Revit 2024 API
BuiltInFailures.HostObjFailures Class
 Failures about HostObj.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class HostObjFailures
Visual Basic
Public NotInheritable Class HostObjFailures
Visual C++
public ref class HostObjFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.HostObjFailures
See Also
BuiltInFailures.HostObjFailures Members
Autodesk.Revit.DB Namespace